spec/fixtures/vcr_cassettes/ogone/master_payment_acceptance.yml

---
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :post
    uri: https://secure.ogone.com:443/ncol/test/orderdirect.asp
    body: orderID=4ac1422ef5518f7d1bde6b74ccd647&COM=SublimeVideo+Invoices%3A+%23iyu7xqfa&ALIAS=o3f8kk3q&FLAG3D=Y&WIN3DS=MAINW&HTTP_ACCEPT=%2A%2F%2A&PARAMPLUS=PAYMENT%3DTRUE%26ACTION%3Dcreate&CN=Jime+-&CARDNO=5399999999999999&ED=0612&CVC=111&OwnerZip=2000&ownercty=CH&EMAIL=email7%40user.com&REMOTE_ADDR=127.0.0.1&currency=USD&amount=10692&PSPID=jilion&USERID=sublime&PSWD=WWQMNC89&Operation=SAL&SHASign=E105A1596B7D3598BDF42C7B3A0F1027DD75C0FBB39F32E95CF5CD3AF4FA56028833A36D95547BA9277AFC02A8D390F4EC09A383AE71D5A625C1DDE3067978DA
    headers:
      content-type:
      - application/x-www-form-urlencoded
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 200
      message: OK
    headers:
      date:
      - Thu, 24 Mar 2011 13:22:28 GMT
      server:
      - Microsoft-IIS/6.0
      x-powered-by:
      - ASP.NET
      content-length:
      - "325"
      content-type:
      - text/html
      cache-control:
      - private
    body: |-
      <?xml version="1.0"?><ncresponse
      orderID="4ac1422ef5518f7d1bde6b74ccd647"
      PAYID="7495629"
      NCSTATUS="0"
      NCERROR="0"
      NCERRORPLUS="!"
      ACCEPTANCE="test123"
      STATUS="9"
      IPCTY="99"
      CCCTY="US"
      ECI="7"
      CVCCheck="NO"
      AAVCheck="NO"
      VC="NO"
      amount="106.92"
      currency="USD"
      PM="CreditCard"
      BRAND="MasterCard"
      ALIAS="o3f8kk3q">
      </ncresponse>
    http_version: "1.1"
