spec/fixtures/vcr_cassettes/ogone/visa_payment_acceptance.yml

---
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :post
    uri: https://secure.ogone.com:443/ncol/test/orderdirect.asp
    body: orderID=99075&COM=SublimeVideo+Invoices%3A+%23av1jj6y6&ALIAS=b7dy0jk2&FLAG3D=Y&WIN3DS=MAINW&HTTP_ACCEPT=%2A%2F%2A&PARAMPLUS=PAYMENT%3DTRUE%26ACTION%3Dcreate&CN=Jime+-&CARDNO=4111111111111111&ED=0612&CVC=111&OwnerZip=2000&ownercty=CH&EMAIL=email6%40user.com&REMOTE_ADDR=127.0.0.1&currency=USD&amount=10692&PSPID=jilion&USERID=sublime&PSWD=WWQMNC89&Operation=SAL&SHASign=694E850D16F75842EC08122D717FE0D54E7761E57BDA7893F182965B8EA871A68ECCA3CEBDC5D0248BF99C5232E851B82459A8C72E0E14879ED477AEDAC3AAB8
    headers:
      content-type:
      - application/x-www-form-urlencoded
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 200
      message: OK
    headers:
      date:
      - Thu, 24 Mar 2011 13:22:13 GMT
      server:
      - Microsoft-IIS/6.0
      x-powered-by:
      - ASP.NET
      content-length:
      - "319"
      content-type:
      - text/html
      cache-control:
      - private
    body: |-
      <?xml version="1.0"?><ncresponse
      orderID="99075"
      PAYID="9683069"
      NCSTATUS="0"
      NCERROR="0"
      NCERRORPLUS="!"
      ACCEPTANCE="test123"
      STATUS="9"
      IPCTY="99"
      CCCTY="US"
      ECI="12"
      CVCCheck="NO"
      AAVCheck="NO"
      VC="NO"
      amount="106.92"
      currency="USD"
      PM="CreditCard"
      BRAND="VISA"
      ALIAS="b7dy0jk2">
      </ncresponse>
    http_version: "1.1"
